ekhpascal/HillGrov/zone/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_HG_ROLE_ZONE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_BT_ENABLED=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xE000
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC=y
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC_SIZE=0x100
# Default 9000 ms is shorter than the 10 s rescue-button hold (Task 15):
# the RTC WDT would reset the chip mid-hold (reset loop) or mid-nvs-erase.
CONFIG_BOOTLOADER_WDT_TIME_MS=30000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=8
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_VERSION_1=y
